tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18344_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18344_H_
#define _PIC16LF18344_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTB                         35
#define RB4                           36
#define RB5                           37
#define RB6                           38
#define RB7                           39
#define PORTC                         40
#define RC0                           41
#define RC1                           42
#define RC2                           43
#define RC3                           44
#define RC4                           45
#define RC5                           46
#define RC6                           47
#define RC7                           48
#define PIR0                          49
#define INTF                          50
#define IOCIF                         51
#define TMR0IF                        52
#define PIR1                          53
#define TMR1IF                        54
#define TMR2IF                        55
#define BCL1IF                        56
#define SSP1IF                        57
#define TXIF                          58
#define RCIF                          59
#define ADIF                          60
#define TMR1GIF                       61
#define PIR2                          62
#define NCO1IF                        63
#define TMR4IF                        64
#define NVMIF                         65
#define C1IF                          66
#define C2IF                          67
#define TMR6IF                        68
#define PIR3                          69
#define CLC1IF                        70
#define CLC2IF                        71
#define CLC3IF                        72
#define CLC4IF                        73
#define TMR3IF                        74
#define TMR3GIF                       75
#define CSWIF                         76
#define OSFIF                         77
#define PIR4                          78
#define CCP1IF                        79
#define CCP2IF                        80
#define CCP3IF                        81
#define CCP4IF                        82
#define TMR5IF                        83
#define TMR5GIF                       84
#define CWG1IF                        85
#define CWG2IF                        86
#define TMR00                         87
#define TMR0L                         88
#define TMR01                         89
#define TMR02                         90
#define TMR03                         91
#define TMR04                         92
#define TMR05                         93
#define TMR06                         94
#define TMR07                         95
#define TMR08                         96
#define TMR0H                         97
#define TMR09                         98
#define TMR010                        99
#define TMR011                        100
#define TMR012                        101
#define TMR013                        102
#define TMR014                        103
#define TMR015                        104
#define T0CON0                        105
#define T0OUTPS                       106
#define T0OUTPS0                      107
#define T0OUTPS1                      108
#define T0OUTPS2                      109
#define T0OUTPS3                      110
#define T016BIT                       111
#define T0OUT                         112
#define T0EN                          113
#define T0CON1                        114
#define T0CKPS                        115
#define T0CKPS0                       116
#define T0CKPS1                       117
#define T0CKPS2                       118
#define T0CKPS3                       119
#define T0ASYNC                       120
#define T0CS                          121
#define T0CS0                         122
#define T0CS1                         123
#define T0CS2                         124
#define TMR1L                         125
#define TMR1H                         126
#define T1CON                         127
#define TMR1ON                        128
#define T1SYNC                        129
#define T1SOSC                        130
#define T1CKPS0                       131
#define T1CKPS                        132
#define T1CKPS1                       133
#define TMR1CS0                       134
#define TMR1CS                        135
#define TMR1CS1                       136
#define T1GCON                        137
#define T1GSS0                        138
#define T1GSS                         139
#define T1GSS1                        140
#define T1GVAL                        141
#define T1GGO_nDONE                   142
#define T1GSPM                        143
#define T1GTM                         144
#define T1GPOL                        145
#define TMR1GE                        146
#define TMR2                          147
#define PR2                           148
#define T2CON                         149
#define T2CKPS0                       150
#define T2CKPS                        151
#define T2CKPS1                       152
#define TMR2ON                        153
#define T2OUTPS0                      154
#define T2OUTPS                       155
#define T2OUTPS1                      156
#define T2OUTPS2                      157
#define T2OUTPS3                      158
#define TRISA                         159
#define TRISA0                        160
#define TRISA1                        161
#define TRISA2                        162
#define TRISA4                        163
#define TRISA5                        164
#define TRISB                         165
#define TRISB4                        166
#define TRISB5                        167
#define TRISB6                        168
#define TRISB7                        169
#define TRISC                         170
#define TRISC0                        171
#define TRISC1                        172
#define TRISC2                        173
#define TRISC3                        174
#define TRISC4                        175
#define TRISC5                        176
#define TRISC6                        177
#define TRISC7                        178
#define PIE0                          179
#define INTE                          180
#define IOCIE                         181
#define TMR0IE                        182
#define PIE1                          183
#define TMR1IE                        184
#define TMR2IE                        185
#define BCL1IE                        186
#define SSP1IE                        187
#define TXIE                          188
#define RCIE                          189
#define ADIE                          190
#define TMR1GIE                       191
#define PIE2                          192
#define NCO1IE                        193
#define TMR4IE                        194
#define NVMIE                         195
#define C1IE                          196
#define C2IE                          197
#define TMR6IE                        198
#define PIE3                          199
#define CLC1IE                        200
#define CLC2IE                        201
#define CLC3IE                        202
#define CLC4IE                        203
#define TMR3IE                        204
#define TMR3GIE                       205
#define CSWIE                         206
#define OSFIE                         207
#define PIE4                          208
#define CCP1IE                        209
#define CCP2IE                        210
#define CCP3IE                        211
#define CCP4IE                        212
#define TMR5IE                        213
#define TMR5GIE                       214
#define CWG1IE                        215
#define CWG2IE                        216
#define WDTCON                        217
#define SWDTEN                        218
#define WDTPS                         219
#define WDTPS0                        220
#define WDTPS1                        221
#define WDTPS2                        222
#define WDTPS3                        223
#define WDTPS4                        224
#define ADRESL                        225
#define ADRESH                        226
#define ADCON0                        227
#define ADON                          228
#define GO_nDONE                      229
#define GO                            230
#define ADGO                          231
#define CHS0                          232
#define CHS                           233
#define CHS1                          234
#define CHS2                          235
#define CHS3                          236
#define CHS4                          237
#define CHS5                          238
#define ADCON1                        239
#define ADPREF0                       240
#define ADPREF                        241
#define ADPREF1                       242
#define ADNREF                        243
#define ADCS0                         244
#define ADCS                          245
#define ADCS1                         246
#define ADCS2                         247
#define ADFM                          248
#define ADACT0                        249
#define ADACT                         250
#define ADACT1                        251
#define ADACT2                        252
#define ADACT3                        253
#define ADACT4                        254
#define LATA                          255
#define LATA0                         256
#define LATA1                         257
#define LATA2                         258
#define LATA4                         259
#define LATA5                         260
#define LATB                          261
#define LATB4                         262
#define LATB5                         263
#define LATB6                         264
#define LATB7                         265
#define LATC                          266
#define LATC0                         267
#define LATC1                         268
#define LATC2                         269
#define LATC3                         270
#define LATC4                         271
#define LATC5                         272
#define LATC6                         273
#define LATC7                         274
#define CM1CON0                       275
#define C1SYNC                        276
#define C1HYS                         277
#define C1SP                          278
#define C1POL                         279
#define C1OUT                         280
#define C1ON                          281
#define CM1CON1                       282
#define C1NCH0                        283
#define C1NCH                         284
#define C1NCH1                        285
#define C1NCH2                        286
#define C1PCH                         287
#define C1PCH0                        288
#define C1PCH1                        289
#define C1PCH2                        290
#define C1INTN                        291
#define C1INTP                        292
#define CM2CON0                       293
#define C2SYNC                        294
#define C2HYS                         295
#define C2SP                          296
#define C2POL                         297
#define C2OUT                         298
#define C2ON                          299
#define CM2CON1                       300
#define C2NCH0                        301
#define C2NCH                         302
#define C2NCH1                        303
#define C2NCH2                        304
#define C2PCH                         305
#define C2PCH0                        306
#define C2PCH1                        307
#define C2PCH2                        308
#define C2INTN                        309
#define C2INTP                        310
#define CMOUT                         311
#define MC1OUT                        312
#define MC2OUT                        313
#define BORCON                        314
#define BORRDY                        315
#define SBOREN                        316
#define FVRCON                        317
#define ADFVR0                        318
#define ADFVR                         319
#define ADFVR1                        320
#define CDAFVR                        321
#define CDAFVR0                       322
#define CDAFVR1                       323
#define TSRNG                         324
#define TSEN                          325
#define FVRRDY                        326
#define FVREN                         327
#define DACCON0                       328
#define DAC1NSS                       329
#define DAC1PSS                       330
#define DAC1PSS0                      331
#define DAC1PSS1                      332
#define DAC1OE                        333
#define DAC1EN                        334
#define DACCON1                       335
#define DAC1R                         336
#define DAC1R0                        337
#define DAC1R1                        338
#define DAC1R2                        339
#define DAC1R3                        340
#define DAC1R4                        341
#define ANSELA                        342
#define ANSA0                         343
#define ANSA1                         344
#define ANSA2                         345
#define ANSA4                         346
#define ANSA5                         347
#define ANSELB                        348
#define ANSB4                         349
#define ANSB5                         350
#define ANSB6                         351
#define ANSB7                         352
#define ANSELC                        353
#define ANSC0                         354
#define ANSC1                         355
#define ANSC2                         356
#define ANSC3                         357
#define ANSC4                         358
#define ANSC5                         359
#define ANSC6                         360
#define ANSC7                         361
#define RC1REG                        362
#define TX1REG                        363
#define SP1BRGL                       364
#define SP1BRGH                       365
#define RC1STA                        366
#define RX9D                          367
#define OERR                          368
#define FERR                          369
#define ADDEN                         370
#define CREN                          371
#define SREN                          372
#define RX9                           373
#define SPEN                          374
#define TX1STA                        375
#define TX9D                          376
#define TRMT                          377
#define BRGH                          378
#define SENDB                         379
#define SYNC                          380
#define TXEN                          381
#define TX9                           382
#define CSRC                          383
#define BAUD1CON                      384
#define ABDEN                         385
#define WUE                           386
#define BRG16                         387
#define SCKP                          388
#define RCIDL                         389
#define ABDOVF                        390
#define WPUA                          391
#define WPUA0                         392
#define WPUA1                         393
#define WPUA2                         394
#define WPUA3                         395
#define WPUA4                         396
#define WPUA5                         397
#define WPUB                          398
#define WPUB4                         399
#define WPUB5                         400
#define WPUB6                         401
#define WPUB7                         402
#define WPUC                          403
#define WPUC0                         404
#define WPUC1                         405
#define WPUC2                         406
#define WPUC3                         407
#define WPUC4                         408
#define WPUC5                         409
#define WPUC6                         410
#define WPUC7                         411
#define SSP1BUF                       412
#define BUF                           413
#define BUF0                          414
#define SSP1BUF0                      415
#define BUF1                          416
#define SSP1BUF1                      417
#define BUF2                          418
#define SSP1BUF2                      419
#define BUF3                          420
#define SSP1BUF3                      421
#define BUF4                          422
#define SSP1BUF4                      423
#define BUF5                          424
#define SSP1BUF5                      425
#define BUF6                          426
#define SSP1BUF6                      427
#define BUF7                          428
#define SSP1BUF7                      429
#define ADD0                          430
#define ADD                           431
#define SSP1ADD0                      432
#define SSP1ADD                       433
#define ADD1                          434
#define SSP1ADD1                      435
#define ADD2                          436
#define SSP1ADD2                      437
#define ADD3                          438
#define SSP1ADD3                      439
#define ADD4                          440
#define SSP1ADD4                      441
#define ADD5                          442
#define SSP1ADD5                      443
#define ADD6                          444
#define SSP1ADD6                      445
#define ADD7                          446
#define SSP1ADD7                      447
#define SSP1MSK0                      448
#define SSP1MSK                       449
#define MSK0                          450
#define MSK                           451
#define SSP1MSK1                      452
#define MSK1                          453
#define SSP1MSK2                      454
#define MSK2                          455
#define SSP1MSK3                      456
#define MSK3                          457
#define SSP1MSK4                      458
#define MSK4                          459
#define SSP1MSK5                      460
#define MSK5                          461
#define SSP1MSK6                      462
#define MSK6                          463
#define SSP1MSK7                      464
#define MSK7                          465
#define SSP1STAT                      466
#define BF                            467
#define UA                            468
#define R_nW                          469
#define S                             470
#define P                             471
#define D_nA                          472
#define CKE                           473
#define SMP                           474
#define SSP1CON1                      475
#define SSPM0                         476
#define SSPM                          477
#define SSPM1                         478
#define SSPM2                         479
#define SSPM3                         480
#define CKP                           481
#define SSPEN                         482
#define SSPOV                         483
#define WCOL                          484
#define SSP1CON2                      485
#define SEN                           486
#define RSEN                          487
#define PEN                           488
#define RCEN                          489
#define ACKEN                         490
#define ACKDT                         491
#define ACKSTAT                       492
#define GCEN                          493
#define SSP1CON3                      494
#define DHEN                          495
#define AHEN                          496
#define SBCDE                         497
#define SDAHT                         498
#define BOEN                          499
#define SCIE                          500
#define PCIE                          501
#define ACKTIM                        502
#define ODCONA                        503
#define ODCA0                         504
#define ODCA1                         505
#define ODCA2                         506
#define ODCA4                         507
#define ODCA5                         508
#define ODCONB                        509
#define ODCB4                         510
#define ODCB5                         511
#define ODCB6                         512
#define ODCB7                         513
#define ODCONC                        514
#define ODCC0                         515
#define ODCC1                         516
#define ODCC2                         517
#define ODCC3                         518
#define ODCC4                         519
#define ODCC5                         520
#define ODCC6                         521
