tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18344_tdd.h
#define ODCC7                         522
#define CCPR1L                        523
#define CCPR1H                        524
#define CCP1CON                       525
#define CCP1MODE                      526
#define CCP1MODE0                     527
#define CCP1MODE1                     528
#define CCP1MODE2                     529
#define CCP1MODE3                     530
#define CCP1FMT                       531
#define CCP1OUT                       532
#define CCP1EN                        533
#define CCP1CAP                       534
#define CCP1CTS                       535
#define CCP1CTS0                      536
#define CCP1CTS1                      537
#define CCP1CTS2                      538
#define CCP1CTS3                      539
#define CCPR2L                        540
#define CCPR2H                        541
#define CCP2CON                       542
#define CCP2MODE                      543
#define CCP2MODE0                     544
#define CCP2MODE1                     545
#define CCP2MODE2                     546
#define CCP2MODE3                     547
#define CCP2FMT                       548
#define CCP2OUT                       549
#define CCP2EN                        550
#define CCP2CAP                       551
#define CCP2CTS                       552
#define CCP2CTS0                      553
#define CCP2CTS1                      554
#define CCP2CTS2                      555
#define CCP2CTS3                      556
#define CCPTMRS                       557
#define C1TSEL0                       558
#define C1TSEL                        559
#define C1TSEL1                       560
#define C2TSEL0                       561
#define C2TSEL                        562
#define C2TSEL1                       563
#define C3TSEL0                       564
#define C3TSEL                        565
#define C3TSEL1                       566
#define C4TSEL                        567
#define C4TSEL0                       568
#define C4TSEL1                       569
#define SLRCONA                       570
#define SLRA0                         571
#define SLRA1                         572
#define SLRA2                         573
#define SLRA4                         574
#define SLRA5                         575
#define SLRCONB                       576
#define SLRB4                         577
#define SLRB5                         578
#define SLRB6                         579
#define SLRB7                         580
#define SLRCONC                       581
#define SLRC0                         582
#define SLRC1                         583
#define SLRC2                         584
#define SLRC3                         585
#define SLRC4                         586
#define SLRC5                         587
#define SLRC6                         588
#define SLRC7                         589
#define CCPR3L                        590
#define CCPR3H                        591
#define CCP3CON                       592
#define CCP3MODE0                     593
#define CCP3MODE                      594
#define CCP3MODE1                     595
#define CCP3MODE2                     596
#define CCP3MODE3                     597
#define CCP3FMT                       598
#define CCP3OUT                       599
#define CCP3EN                        600
#define CCP3CAP                       601
#define CCP3CTS                       602
#define CCP3CTS0                      603
#define CCP3CTS1                      604
#define CCP3CTS2                      605
#define CCP3CTS3                      606
#define CCPR4L                        607
#define CCPR4H                        608
#define CCP4CON                       609
#define CCP4MODE                      610
#define CCP4MODE0                     611
#define CCP4MODE1                     612
#define CCP4MODE2                     613
#define CCP4MODE3                     614
#define CCP4FMT                       615
#define CCP4OUT                       616
#define CCP4EN                        617
#define CCP4CAP                       618
#define CCP4CTS                       619
#define CCP4CTS0                      620
#define CCP4CTS1                      621
#define CCP4CTS2                      622
#define CCP4CTS3                      623
#define INLVLA                        624
#define INLVLA0                       625
#define INLVLA1                       626
#define INLVLA2                       627
#define INLVLA3                       628
#define INLVLA4                       629
#define INLVLA5                       630
#define INLVLB                        631
#define INLVLB4                       632
#define INLVLB5                       633
#define INLVLB6                       634
#define INLVLB7                       635
#define INLVLC                        636
#define INLVLC0                       637
#define INLVLC1                       638
#define INLVLC2                       639
#define INLVLC3                       640
#define INLVLC4                       641
#define INLVLC5                       642
#define INLVLC6                       643
#define INLVLC7                       644
#define IOCAP                         645
#define IOCAP0                        646
#define IOCAP1                        647
#define IOCAP2                        648
#define IOCAP3                        649
#define IOCAP4                        650
#define IOCAP5                        651
#define IOCAN                         652
#define IOCAN0                        653
#define IOCAN1                        654
#define IOCAN2                        655
#define IOCAN3                        656
#define IOCAN4                        657
#define IOCAN5                        658
#define IOCAF                         659
#define IOCAF0                        660
#define IOCAF1                        661
#define IOCAF2                        662
#define IOCAF3                        663
#define IOCAF4                        664
#define IOCAF5                        665
#define IOCBP                         666
#define IOCBP4                        667
#define IOCBP5                        668
#define IOCBP6                        669
#define IOCBP7                        670
#define IOCBN                         671
#define IOCBN4                        672
#define IOCBN5                        673
#define IOCBN6                        674
#define IOCBN7                        675
#define IOCBF                         676
#define IOCBF4                        677
#define IOCBF5                        678
#define IOCBF6                        679
#define IOCBF7                        680
#define IOCCP                         681
#define IOCCP0                        682
#define IOCCP1                        683
#define IOCCP2                        684
#define IOCCP3                        685
#define IOCCP4                        686
#define IOCCP5                        687
#define IOCCP6                        688
#define IOCCP7                        689
#define IOCCN                         690
#define IOCCN0                        691
#define IOCCN1                        692
#define IOCCN2                        693
#define IOCCN3                        694
#define IOCCN4                        695
#define IOCCN5                        696
#define IOCCN6                        697
#define IOCCN7                        698
#define IOCCF                         699
#define IOCCF0                        700
#define IOCCF1                        701
#define IOCCF2                        702
#define IOCCF3                        703
#define IOCCF4                        704
#define IOCCF5                        705
#define IOCCF6                        706
#define IOCCF7                        707
#define CLKRCON                       708
#define CLKRDIV                       709
#define CLKRDIV0                      710
#define CLKRDIV1                      711
#define CLKRDIV2                      712
#define CLKRDC                        713
#define CLKRDC0                       714
#define CLKRDC1                       715
#define CLKREN                        716
#define MDCON                         717
#define MDBIT                         718
#define MDOUT                         719
#define MDOPOL                        720
#define MDEN                          721
#define MDSRC                         722
#define MDMS0                         723
#define MDMS                          724
#define MDMS1                         725
#define MDMS2                         726
#define MDMS3                         727
#define MDCARH                        728
#define MDCH                          729
#define MDCH0                         730
#define MDCH1                         731
#define MDCH2                         732
#define MDCH3                         733
#define MDCHSYNC                      734
#define MDCHPOL                       735
#define MDCARL                        736
#define MDCL0                         737
#define MDCL                          738
#define MDCL1                         739
#define MDCL2                         740
#define MDCL3                         741
#define MDCLSYNC                      742
#define MDCLPOL                       743
#define CCDNA                         744
#define CCDNA0                        745
#define CCDNA1                        746
#define CCDNA2                        747
#define CCDNA4                        748
#define CCDNA5                        749
#define CCDNB                         750
#define CCDNB4                        751
#define CCDNB5                        752
#define CCDNB6                        753
#define CCDNB7                        754
#define CCDNC                         755
#define CCDNC0                        756
#define CCDNC1                        757
#define CCDNC2                        758
#define CCDNC3                        759
#define CCDNC4                        760
#define CCDNC5                        761
#define CCDNC6                        762
#define CCDNC7                        763
#define TMR3L                         764
#define TMR3H                         765
#define T3CON                         766
#define TMR3ON                        767
#define T3SYNC                        768
#define T3SOSC                        769
#define T3CKPS                        770
#define T3CKPS0                       771
#define T3CKPS1                       772
#define TMR3CS0                       773
#define TMR3CS                        774
#define TMR3CS1                       775
#define T3GCON                        776
#define T3GSS0                        777
#define T3GSS                         778
#define T3GSS1                        779
#define T3GVAL                        780
#define T3GGO_nDONE                   781
#define T3GSPM                        782
#define T3GTM                         783
#define T3GPOL                        784
#define TMR3GE                        785
#define TMR4                          786
#define PR4                           787
#define T4CON                         788
#define T4CKPS0                       789
#define T4CKPS                        790
#define T4CKPS1                       791
#define TMR4ON                        792
#define T4OUTPS                       793
#define T4OUTPS0                      794
#define T4OUTPS1                      795
#define T4OUTPS2                      796
#define T4OUTPS3                      797
#define TMR5L                         798
#define TMR5H                         799
#define T5CON                         800
#define TMR5ON                        801
#define T5SYNC                        802
#define T5SOSC                        803
#define T5CKPS                        804
#define T5CKPS0                       805
#define T5CKPS1                       806
#define TMR5CS0                       807
#define TMR5CS                        808
#define TMR5CS1                       809
#define T5GCON                        810
#define T5GSS                         811
#define T5GSS0                        812
#define T5GSS1                        813
#define T5GVAL                        814
#define T5GGO_nDONE                   815
#define T5GSPM                        816
#define T5GTM                         817
#define T5GPOL                        818
#define TMR5GE                        819
#define TMR6                          820
#define PR6                           821
#define T6CON                         822
#define T6CKPS0                       823
#define T6CKPS                        824
#define T6CKPS1                       825
#define TMR6ON                        826
#define T6OUTPS0                      827
#define T6OUTPS                       828
#define T6OUTPS1                      829
#define T6OUTPS2                      830
#define T6OUTPS3                      831
#define CCDCON                        832
#define CCDS                          833
#define CCDS0                         834
#define CCDS1                         835
#define CCDEN                         836
#define CCDPA                         837
#define CCDPA0                        838
#define CCDPA1                        839
#define CCDPA2                        840
#define CCDPA4                        841
#define CCDPA5                        842
#define CCDPB                         843
#define CCDPB4                        844
#define CCDPB5                        845
#define CCDPB6                        846
#define CCDPB7                        847
#define CCDPC                         848
#define CCDPC0                        849
#define CCDPC1                        850
#define CCDPC2                        851
#define CCDPC3                        852
#define CCDPC4                        853
#define CCDPC5                        854
#define CCDPC6                        855
#define CCDPC7                        856
#define NCO1ACCL                      857
#define NCO1ACCL_NCO1ACC              858
#define NCO1ACCH                      859
#define NCO1ACCH_NCO1ACC              860
#define NCO1ACCU                      861
#define NCO1ACCU_NCO1ACC              862
#define NCO1INCL                      863
#define NCO1INCL_NCO1INC              864
#define NCO1INCH                      865
#define NCO1INCH_NCO1INC              866
#define NCO1INCU                      867
#define NCO1INCU_NCO1INC              868
#define NCO1CON                       869
#define N1PFM                         870
#define N1POL                         871
#define N1OUT                         872
#define N1EN                          873
#define NCO1CLK                       874
#define N1CKS                         875
#define N1PWS                         876
#define PWM5DCL                       877
#define PWM5DCL0                      878
#define PWM5DCL1                      879
#define PWM5DCH                       880
#define PWM5DCH0                      881
#define PWM5DCH1                      882
#define PWM5DCH2                      883
#define PWM5DCH3                      884
#define PWM5DCH4                      885
#define PWM5DCH5                      886
#define PWM5DCH6                      887
#define PWM5DCH7                      888
#define PWM5CON                       889
#define PWM5POL                       890
#define PWM5OUT                       891
#define PWM5EN                        892
#define PWM6DCL                       893
#define PWM6DCL0                      894
#define PWM6DCL1                      895
#define PWM6DCH                       896
#define PWM6DCH0                      897
#define PWM6DCH1                      898
#define PWM6DCH2                      899
#define PWM6DCH3                      900
#define PWM6DCH4                      901
#define PWM6DCH5                      902
#define PWM6DCH6                      903
#define PWM6DCH7                      904
#define PWM6CON                       905
#define PWM6POL                       906
#define PWM6OUT                       907
#define PWM6EN                        908
#define PWMTMRS                       909
#define P5TSEL                        910
#define P5TSEL0                       911
#define P5TSEL1                       912
#define P6TSEL0                       913
#define P6TSEL                        914
#define P6TSEL1                       915
#define CWG1CLKCON                    916
#define CWG1CLKCON_CS                 917
#define CWG1CS                        918
#define CWG1DAT                       919
#define CWG1DAT_DAT                   920
#define CWG1DAT0                      921
#define CWG1DAT1                      922
#define CWG1DAT2                      923
#define CWG1DAT3                      924
#define CWG1DBR_DBR                   925
#define CWG1DBR0                      926
#define CWG1DBR_DBR0                  927
#define CWG1DBR                       928
#define CWG1DBR1                      929
#define CWG1DBR_DBR1                  930
#define CWG1DBR2                      931
#define CWG1DBR_DBR2                  932
#define CWG1DBR3                      933
#define CWG1DBR_DBR3                  934
#define CWG1DBR_DBR4                  935
#define CWG1DBR4                      936
#define CWG1DBR5                      937
#define CWG1DBR_DBR5                  938
#define CWG1DBF                       939
#define CWG1DBF0                      940
#define CWG1DBF_DBF                   941
#define CWG1DBF_DBF0                  942
#define CWG1DBF1                      943
#define CWG1DBF_DBF1                  944
#define CWG1DBF_DBF2                  945
#define CWG1DBF2                      946
#define CWG1DBF3                      947
#define CWG1DBF_DBF3                  948
#define CWG1DBF_DBF4                  949
#define CWG1DBF4                      950
#define CWG1DBF_DBF5                  951
#define CWG1DBF5                      952
#define CWG1CON0                      953
#define CWG1MODE0                     954
#define CWG1CON0_MODE                 955
#define CWG1CON0_MODE0                956
#define CWG1MODE                      957
#define CWG1MODE1                     958
#define CWG1CON0_MODE1                959
#define CWG1MODE2                     960
#define CWG1CON0_MODE2                961
#define CWG1CON0_LD                   962
#define CWG1LD                        963
#define CWG1EN                        964
#define G1EN                          965
#define CWG1CON0_EN                   966
#define CWG1CON1                      967
#define CWG1POLA                      968
#define CWG1CON1_POLA                 969
#define CWG1CON1_POLB                 970
#define CWG1POLB                      971
#define CWG1POLC                      972
#define CWG1CON1_POLC                 973
#define CWG1CON1_POLD                 974
#define CWG1POLD                      975
#define CWG1CON1_IN                   976
#define CWG1IN                        977
#define CWG1AS0                       978
#define CWG1LSAC                      979
#define CWG1AS0_LSAC0                 980
#define CWG1AS0_LSAC                  981
#define CWG1LSAC0                     982
#define CWG1AS0_LSAC1                 983
#define CWG1LSAC1                     984
#define CWG1AS0_LSBD0                 985
#define CWG1LSBD0                     986
#define CWG1LSBD                      987
#define CWG1AS0_LSBD                  988
#define CWG1LSBD1                     989
#define CWG1AS0_LSBD1                 990
#define CWG1AS0_REN                   991
#define CWG1REN                       992
#define CWG1AS0_SHUTDOWN              993
#define CWG1SHUTDOWN                  994
#define CWG1AS1                       995
#define CWG1AS1_AS0E                  996
#define CWG1AS1_AS1E                  997
#define CWG1AS1_AS2E                  998
#define CWG1AS1_AS3E                  999
#define CWG1AS1_AS4E                  1000
#define CWG1STR                       1001
#define CWG1STRA                      1002
#define CWG1STR_STRA                  1003
#define CWG1STRB                      1004
#define CWG1STR_STRB                  1005
#define CWG1STRC                      1006
#define CWG1STR_STRC                  1007
#define CWG1STR_STRD                  1008
#define CWG1STRD                      1009
#define CWG1OVRA                      1010
#define CWG1STR_OVRA                  1011
#define CWG1OVRB                      1012
#define CWG1STR_OVRB                  1013
#define CWG1OVRC                      1014
#define CWG1STR_OVRC                  1015
#define CWG1OVRD                      1016
#define CWG1STR_OVRD                  1017
#define CWG2CLKCON                    1018
#define CWG2CS                        1019
#define CWG2CLKCON_CS                 1020
#define CWG2DAT                       1021
#define CWG2DAT0                      1022
#define CWG2DAT_DAT                   1023
#define CWG2DAT1                      1024
#define CWG2DAT2                      1025
#define CWG2DAT3                      1026
#define CWG2DBR_DBR                   1027
#define CWG2DBR_DBR0                  1028
#define CWG2DBR                       1029
#define CWG2DBR0                      1030
#define CWG2DBR_DBR1                  1031
#define CWG2DBR1                      1032
#define CWG2DBR_DBR2                  1033
#define CWG2DBR2                      1034
#define CWG2DBR_DBR3                  1035
#define CWG2DBR3                      1036
#define CWG2DBR_DBR4                  1037
#define CWG2DBR4                      1038
#define CWG2DBR_DBR5                  1039
#define CWG2DBR5                      1040
#define CWG2DBF                       1041
#define CWG2DBF_DBF0                  1042
#define CWG2DBF_DBF                   1043
#define CWG2DBF0                      1044
#define CWG2DBF_DBF1                  1045
#define CWG2DBF1                      1046
#define CWG2DBF_DBF2                  1047
#define CWG2DBF2                      1048
#define CWG2DBF_DBF3                  1049
#define CWG2DBF3                      1050
#define CWG2DBF_DBF4                  1051
#define CWG2DBF4                      1052
#define CWG2DBF5                      1053
#define CWG2DBF_DBF5                  1054
#define CWG2CON0                      1055
#define CWG2MODE                      1056
#define CWG2MODE0                     1057
#define CWG2CON0_MODE                 1058
#define CWG2CON0_MODE0                1059
#define CWG2MODE1                     1060
#define CWG2CON0_MODE1                1061
#define CWG2MODE2                     1062
#define CWG2CON0_MODE2                1063
#define CWG2LD                        1064
#define CWG2CON0_LD                   1065
#define CWG2CON0_EN                   1066
#define CWG2EN                        1067
#define G2EN                          1068
#define CWG2CON1                      1069
#define CWG2POLA                      1070
#define CWG2CON1_POLA                 1071
#define CWG2POLB                      1072
#define CWG2CON1_POLB                 1073
#define CWG2POLC                      1074
#define CWG2CON1_POLC                 1075
#define CWG2CON1_POLD                 1076
#define CWG2POLD                      1077
#define CWG2IN                        1078
#define CWG2CON1_IN                   1079
#define CWG2AS0                       1080
#define CWG2LSAC                      1081
#define CWG2AS0_LSAC                  1082
#define CWG2LSAC0                     1083
#define CWG2AS0_LSAC0                 1084
#define CWG2LSAC1                     1085
#define CWG2AS0_LSAC1                 1086
#define CWG2AS0_LSBD0                 1087
#define CWG2LSBD                      1088
#define CWG2AS0_LSBD                  1089
#define CWG2LSBD0                     1090
