tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18344_tdd.h
#define CWG2AS0_LSBD1                 1091
#define CWG2LSBD1                     1092
#define CWG2AS0_REN                   1093
#define CWG2REN                       1094
#define CWG2AS0_SHUTDOWN              1095
#define CWG2SHUTDOWN                  1096
#define CWG2AS1                       1097
#define CWG2AS1_AS0E                  1098
#define CWG2AS1_AS1E                  1099
#define CWG2AS1_AS2E                  1100
#define CWG2AS1_AS3E                  1101
#define CWG2AS1_AS4E                  1102
#define CWG2STR                       1103
#define CWG2STR_STRA                  1104
#define CWG2STRA                      1105
#define CWG2STR_STRB                  1106
#define CWG2STRB                      1107
#define CWG2STR_STRC                  1108
#define CWG2STRC                      1109
#define CWG2STR_STRD                  1110
#define CWG2STRD                      1111
#define CWG2STR_OVRA                  1112
#define CWG2OVRA                      1113
#define CWG2OVRB                      1114
#define CWG2STR_OVRB                  1115
#define CWG2STR_OVRC                  1116
#define CWG2OVRC                      1117
#define CWG2OVRD                      1118
#define CWG2STR_OVRD                  1119
#define NVMADR0                       1120
#define NVMADRL                       1121
#define NVMADR1                       1122
#define NVMADR2                       1123
#define NVMADR3                       1124
#define NVMADR4                       1125
#define NVMADR5                       1126
#define NVMADR6                       1127
#define NVMADR7                       1128
#define NVMADR8                       1129
#define NVMADRH                       1130
#define NVMADR9                       1131
#define NVMADR10                      1132
#define NVMADR11                      1133
#define NVMADR12                      1134
#define NVMADR13                      1135
#define NVMADR14                      1136
#define NVMDAT0                       1137
#define NVMDATL                       1138
#define NVMDAT1                       1139
#define NVMDAT2                       1140
#define NVMDAT3                       1141
#define NVMDAT4                       1142
#define NVMDAT5                       1143
#define NVMDAT6                       1144
#define NVMDAT7                       1145
#define NVMDAT8                       1146
#define NVMDATH                       1147
#define NVMDAT9                       1148
#define NVMDAT10                      1149
#define NVMDAT11                      1150
#define NVMDAT12                      1151
#define NVMDAT13                      1152
#define NVMCON1                       1153
#define RD                            1154
#define WR                            1155
#define WREN                          1156
#define WRERR                         1157
#define FREE                          1158
#define LWLO                          1159
#define NVMREGS                       1160
#define NVMCON2                       1161
#define NMVCON2                       1162
#define PCON0                         1163
#define nBOR                          1164
#define nPOR                          1165
#define nRI                           1166
#define nRMCLR                        1167
#define nRWDT                         1168
#define STKUNF                        1169
#define STKOVF                        1170
#define PMD0                          1171
#define IOCMD                         1172
#define CLKRMD                        1173
#define NVMMD                         1174
#define FVRMD                         1175
#define SYSCMD                        1176
#define PMD1                          1177
#define TMR0MD                        1178
#define TMR1MD                        1179
#define TMR2MD                        1180
#define TMR3MD                        1181
#define TMR4MD                        1182
#define TMR5MD                        1183
#define TMR6MD                        1184
#define NCOMD                         1185
#define PMD2                          1186
#define CMP1MD                        1187
#define CMP2MD                        1188
#define ADCMD                         1189
#define DACMD                         1190
#define PMD3                          1191
#define CCP1MD                        1192
#define CCP2MD                        1193
#define CCP3MD                        1194
#define CCP4MD                        1195
#define PWM5MD                        1196
#define PWM6MD                        1197
#define CWG1MD                        1198
#define CWG2MD                        1199
#define PMD4                          1200
#define MSSP1MD                       1201
#define UART1MD                       1202
#define PMD5                          1203
#define DSMMD                         1204
#define CLC1MD                        1205
#define CLC2MD                        1206
#define CLC3MD                        1207
#define CLC4MD                        1208
#define CPUDOZE                       1209
#define DOZE0                         1210
#define DOZE                          1211
#define DOZE1                         1212
#define DOZE2                         1213
#define DOE                           1214
#define ROI                           1215
#define DOZEN                         1216
#define IDLEN                         1217
#define OSCCON1                       1218
#define NDIV0                         1219
#define NDIV                          1220
#define NDIV1                         1221
#define NDIV2                         1222
#define NDIV3                         1223
#define NOSC0                         1224
#define NOSC                          1225
#define NOSC1                         1226
#define NOSC2                         1227
#define OSCCON2                       1228
#define CDIV0                         1229
#define CDIV                          1230
#define CDIV1                         1231
#define CDIV2                         1232
#define CDIV3                         1233
#define COSC                          1234
#define COSC0                         1235
#define COSC1                         1236
#define COSC2                         1237
#define OSCCON3                       1238
#define NOSCR                         1239
#define ORDY                          1240
#define SOSCBE                        1241
#define SOSCPWR                       1242
#define CSWHOLD                       1243
#define OSCSTAT1                      1244
#define PLLR                          1245
#define ADOR                          1246
#define SOR                           1247
#define LFOR                          1248
#define HFOR                          1249
#define EXTOR                         1250
#define OSCEN                         1251
#define ADOEN                         1252
#define SOSCEN                        1253
#define LFOEN                         1254
#define HFOEN                         1255
#define EXTOEN                        1256
#define OSCTUNE                       1257
#define HFTUN0                        1258
#define HFTUN                         1259
#define HFTUN1                        1260
#define HFTUN2                        1261
#define HFTUN3                        1262
#define HFTUN4                        1263
#define HFTUN5                        1264
#define OSCFRQ                        1265
#define HFFRQ                         1266
#define HFFRQ0                        1267
#define HFFRQ1                        1268
#define HFFRQ2                        1269
#define HFFRQ3                        1270
#define PPSLOCK                       1271
#define PPSLOCKED                     1272
#define INTPPS0                       1273
#define INTPPS                        1274
#define INTPPS1                       1275
#define INTPPS2                       1276
#define INTPPS3                       1277
#define INTPPS4                       1278
#define T0CKIPPS0                     1279
#define T0CKIPPS                      1280
#define T0CKIPPS1                     1281
#define T0CKIPPS2                     1282
#define T0CKIPPS3                     1283
#define T0CKIPPS4                     1284
#define T1CKIPPS0                     1285
#define T1CKIPPS                      1286
#define T1CKIPPS1                     1287
#define T1CKIPPS2                     1288
#define T1CKIPPS3                     1289
#define T1CKIPPS4                     1290
#define T1GPPS0                       1291
#define T1GPPS                        1292
#define T1GPPS1                       1293
#define T1GPPS2                       1294
#define T1GPPS3                       1295
#define T1GPPS4                       1296
#define CCP1PPS0                      1297
#define CCP1PPS                       1298
#define CCP1PPS1                      1299
#define CCP1PPS2                      1300
#define CCP1PPS3                      1301
#define CCP1PPS4                      1302
#define CCP2PPS0                      1303
#define CCP2PPS                       1304
#define CCP2PPS1                      1305
#define CCP2PPS2                      1306
#define CCP2PPS3                      1307
#define CCP2PPS4                      1308
#define CCP3PPS0                      1309
#define CCP3PPS                       1310
#define CCP3PPS1                      1311
#define CCP3PPS2                      1312
#define CCP3PPS3                      1313
#define CCP3PPS4                      1314
#define CCP4PPS0                      1315
#define CCP4PPS                       1316
#define CCP4PPS1                      1317
#define CCP4PPS2                      1318
#define CCP4PPS3                      1319
#define CCP4PPS4                      1320
#define CWG1PPS0                      1321
#define CWG1PPS                       1322
#define CWG1PPS1                      1323
#define CWG1PPS2                      1324
#define CWG1PPS3                      1325
#define CWG1PPS4                      1326
#define CWG2PPS0                      1327
#define CWG2PPS                       1328
#define CWG2PPS1                      1329
#define CWG2PPS2                      1330
#define CWG2PPS3                      1331
#define CWG2PPS4                      1332
#define MDCIN1PPS                     1333
#define MDCIN1PPS0                    1334
#define MDCIN1PPS1                    1335
#define MDCIN1PPS2                    1336
#define MDCIN1PPS3                    1337
#define MDCIN1PPS4                    1338
#define MDCIN2PPS0                    1339
#define MDCIN2PPS                     1340
#define MDCIN2PPS1                    1341
#define MDCIN2PPS2                    1342
#define MDCIN2PPS3                    1343
#define MDCIN2PPS4                    1344
#define MDMINPPS                      1345
#define MDMINPPS0                     1346
#define MDMINPPS1                     1347
#define MDMINPPS2                     1348
#define MDMINPPS3                     1349
#define MDMINPPS4                     1350
#define SSP1CLKPPS0                   1351
#define SSP1CLKPPS                    1352
#define SSP1CLKPPS1                   1353
#define SSP1CLKPPS2                   1354
#define SSP1CLKPPS3                   1355
#define SSP1CLKPPS4                   1356
#define SSP1DATPPS0                   1357
#define SSP1DATPPS                    1358
#define SSP1DATPPS1                   1359
#define SSP1DATPPS2                   1360
#define SSP1DATPPS3                   1361
#define SSP1DATPPS4                   1362
#define SSP1SSPPS                     1363
#define SSP1SSPPS0                    1364
#define SSP1SSPPS1                    1365
#define SSP1SSPPS2                    1366
#define SSP1SSPPS3                    1367
#define SSP1SSPPS4                    1368
#define RXPPS                         1369
#define RXDTPPS0                      1370
#define RXDTPPS1                      1371
#define RXDTPPS2                      1372
#define RXDTPPS3                      1373
#define RXDTPPS4                      1374
#define TXCKPPS0                      1375
#define TXPPS                         1376
#define TXCKPPS1                      1377
#define TXCKPPS2                      1378
#define TXCKPPS3                      1379
#define TXCKPPS4                      1380
#define CLCIN0PPS                     1381
#define CLCIN0PPS0                    1382
#define CLCIN0PPS1                    1383
#define CLCIN0PPS2                    1384
#define CLCIN0PPS3                    1385
#define CLCIN0PPS4                    1386
#define CLCIN1PPS0                    1387
#define CLCIN1PPS                     1388
#define CLCIN1PPS1                    1389
#define CLCIN1PPS2                    1390
#define CLCIN1PPS3                    1391
#define CLCIN1PPS4                    1392
#define CLCIN2PPS                     1393
#define CLCIN2PPS0                    1394
#define CLCIN2PPS1                    1395
#define CLCIN2PPS2                    1396
#define CLCIN2PPS3                    1397
#define CLCIN2PPS4                    1398
#define CLCIN3PPS                     1399
#define CLCIN3PPS0                    1400
#define CLCIN3PPS1                    1401
#define CLCIN3PPS2                    1402
#define CLCIN3PPS3                    1403
#define CLCIN3PPS4                    1404
#define T3CKIPPS                      1405
#define T3GPPS                        1406
#define T5CKIPPS                      1407
#define T5GPPS                        1408
#define RA0PPS                        1409
#define RA0PPS0                       1410
#define RA0PPS1                       1411
#define RA0PPS2                       1412
#define RA0PPS3                       1413
#define RA0PPS4                       1414
#define RA1PPS                        1415
#define RA1PPS0                       1416
#define RA1PPS1                       1417
#define RA1PPS2                       1418
#define RA1PPS3                       1419
#define RA1PPS4                       1420
#define RA2PPS0                       1421
#define RA2PPS                        1422
#define RA2PPS1                       1423
#define RA2PPS2                       1424
#define RA2PPS3                       1425
#define RA2PPS4                       1426
#define RA4PPS                        1427
#define RA4PPS0                       1428
#define RA4PPS1                       1429
#define RA4PPS2                       1430
#define RA4PPS3                       1431
#define RA4PPS4                       1432
#define RA5PPS                        1433
#define RA5PPS0                       1434
#define RA5PPS1                       1435
#define RA5PPS2                       1436
#define RA5PPS3                       1437
#define RA5PPS4                       1438
#define RB4PPS                        1439
#define RB5PPS                        1440
#define RB6PPS                        1441
#define RB7PPS                        1442
#define RC0PPS                        1443
#define RC0PPS0                       1444
#define RC0PPS1                       1445
#define RC0PPS2                       1446
#define RC0PPS3                       1447
#define RC0PPS4                       1448
#define RC1PPS0                       1449
#define RC1PPS                        1450
#define RC1PPS1                       1451
#define RC1PPS2                       1452
#define RC1PPS3                       1453
#define RC1PPS4                       1454
#define RC2PPS                        1455
#define RC2PPS0                       1456
#define RC2PPS1                       1457
#define RC2PPS2                       1458
#define RC2PPS3                       1459
#define RC2PPS4                       1460
#define RC3PPS                        1461
#define RC3PPS0                       1462
#define RC3PPS1                       1463
#define RC3PPS2                       1464
#define RC3PPS3                       1465
#define RC3PPS4                       1466
#define RC4PPS0                       1467
#define RC4PPS                        1468
#define RC4PPS1                       1469
#define RC4PPS2                       1470
#define RC4PPS3                       1471
#define RC4PPS4                       1472
#define RC5PPS0                       1473
#define RC5PPS                        1474
#define RC5PPS1                       1475
#define RC5PPS2                       1476
#define RC5PPS3                       1477
#define RC5PPS4                       1478
#define RC6PPS                        1479
#define RC7PPS                        1480
#define CLCDATA                       1481
#define MLC1OUT                       1482
#define MLC2OUT                       1483
#define MLC3OUT                       1484
#define MLC4OUT                       1485
#define CLC1CON                       1486
#define CLC1CON_MODE0                 1487
#define LC1MODE                       1488
#define CLC1CON_MODE                  1489
#define LC1MODE0                      1490
#define CLC1CON_MODE1                 1491
#define LC1MODE1                      1492
#define LC1MODE2                      1493
#define CLC1CON_MODE2                 1494
#define LC1INTN                       1495
#define CLC1CON_INTN                  1496
#define CLC1CON_INTP                  1497
#define LC1INTP                       1498
#define LC1OUT                        1499
#define CLC1CON_OUT                   1500
#define CLC1CON_EN                    1501
#define LC1EN                         1502
#define CLC1POL                       1503
#define LC1G1POL                      1504
#define CLC1POL_G1POL                 1505
#define CLC1POL_G2POL                 1506
#define LC1G2POL                      1507
#define LC1G3POL                      1508
#define CLC1POL_G3POL                 1509
#define LC1G4POL                      1510
#define CLC1POL_G4POL                 1511
#define CLC1POL_POL                   1512
#define LC1POL                        1513
#define CLC1SEL0                      1514
#define CLC1SEL0_D1S0                 1515
#define LC1D1S0                       1516
#define CLC1SEL0_D1S                  1517
#define LC1D1S                        1518
#define CLC1SEL0_D1S1                 1519
#define LC1D1S1                       1520
#define CLC1SEL0_D1S2                 1521
#define LC1D1S2                       1522
#define LC1D1S3                       1523
#define CLC1SEL0_D1S3                 1524
#define CLC1SEL0_D1S4                 1525
#define LC1D1S4                       1526
#define CLC1SEL0_D1S5                 1527
#define LC1D1S5                       1528
#define CLC1SEL1                      1529
#define CLC1SEL1_D2S0                 1530
#define CLC1SEL1_D2S                  1531
#define LC1D2S                        1532
#define LC1D2S0                       1533
#define CLC1SEL1_D2S1                 1534
#define LC1D2S1                       1535
#define CLC1SEL1_D2S2                 1536
#define LC1D2S2                       1537
#define LC1D2S3                       1538
#define CLC1SEL1_D2S3                 1539
#define LC1D2S4                       1540
#define CLC1SEL1_D2S4                 1541
#define LC1D2S5                       1542
#define CLC1SEL1_D2S5                 1543
#define CLC1SEL2                      1544
#define LC1D3S0                       1545
#define CLC1SEL2_D3S                  1546
#define LC1D3S                        1547
#define CLC1SEL2_D3S0                 1548
#define LC1D3S1                       1549
#define CLC1SEL2_D3S1                 1550
#define LC1D3S2                       1551
#define CLC1SEL2_D3S2                 1552
#define LC1D3S3                       1553
#define CLC1SEL2_D3S3                 1554
#define LC1D3S4                       1555
#define CLC1SEL2_D3S4                 1556
#define LC1D3S5                       1557
#define CLC1SEL2_D3S5                 1558
#define CLC1SEL3                      1559
#define CLC1SEL3_D4S                  1560
#define LC1D4S                        1561
#define LC1D4S0                       1562
#define CLC1SEL3_D4S0                 1563
#define CLC1SEL3_D4S1                 1564
#define LC1D4S1                       1565
#define LC1D4S2                       1566
#define CLC1SEL3_D4S2                 1567
#define LC1D4S3                       1568
#define CLC1SEL3_D4S3                 1569
#define LC1D4S4                       1570
#define CLC1SEL3_D4S4                 1571
#define LC1D4S5                       1572
#define CLC1SEL3_D4S5                 1573
#define CLC1GLS0                      1574
#define CLC1GLS0_D1N                  1575
#define LC1G1D1N                      1576
#define CLC1GLS0_D1T                  1577
#define LC1G1D1T                      1578
#define LC1G1D2N                      1579
#define CLC1GLS0_D2N                  1580
#define LC1G1D2T                      1581
#define CLC1GLS0_D2T                  1582
#define CLC1GLS0_D3N                  1583
#define LC1G1D3N                      1584
#define CLC1GLS0_D3T                  1585
#define LC1G1D3T                      1586
#define CLC1GLS0_D4N                  1587
#define LC1G1D4N                      1588
#define CLC1GLS0_D4T                  1589
#define LC1G1D4T                      1590
#define CLC1GLS1                      1591
#define CLC1GLS1_D1N                  1592
#define LC1G2D1N                      1593
#define LC1G2D1T                      1594
#define CLC1GLS1_D1T                  1595
#define CLC1GLS1_D2N                  1596
#define LC1G2D2N                      1597
#define LC1G2D2T                      1598
#define CLC1GLS1_D2T                  1599
#define CLC1GLS1_D3N                  1600
#define LC1G2D3N                      1601
#define LC1G2D3T                      1602
#define CLC1GLS1_D3T                  1603
#define CLC1GLS1_D4N                  1604
#define LC1G2D4N                      1605
#define LC1G2D4T                      1606
#define CLC1GLS1_D4T                  1607
#define CLC1GLS2                      1608
#define CLC1GLS2_D1N                  1609
#define LC1G3D1N                      1610
#define LC1G3D1T                      1611
#define CLC1GLS2_D1T                  1612
#define LC1G3D2N                      1613
#define CLC1GLS2_D2N                  1614
#define LC1G3D2T                      1615
#define CLC1GLS2_D2T                  1616
#define CLC1GLS2_D3N                  1617
#define LC1G3D3N                      1618
#define LC1G3D3T                      1619
#define CLC1GLS2_D3T                  1620
#define LC1G3D4N                      1621
#define CLC1GLS2_D4N                  1622
#define LC1G3D4T                      1623
#define CLC1GLS2_D4T                  1624
#define CLC1GLS3                      1625
#define LC1G4D1N                      1626
#define CLC1GLS3_G4D1N                1627
#define LC1G4D1T                      1628
#define CLC1GLS3_G4D1T                1629
#define CLC1GLS3_G4D2N                1630
#define LC1G4D2N                      1631
#define CLC1GLS3_G4D2T                1632
#define LC1G4D2T                      1633
#define LC1G4D3N                      1634
#define CLC1GLS3_G4D3N                1635
#define LC1G4D3T                      1636
#define CLC1GLS3_G4D3T                1637
#define CLC1GLS3_G4D4N                1638
#define LC1G4D4N                      1639
#define CLC1GLS3_G4D4T                1640
#define LC1G4D4T                      1641
#define CLC2CON                       1642
#define LC2MODE0                      1643
#define CLC2CON_MODE                  1644
#define LC2MODE                       1645
#define CLC2CON_MODE0                 1646
#define LC2MODE1                      1647
#define CLC2CON_MODE1                 1648
