tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18344_tdd.h
#define LC2MODE2                      1649
#define CLC2CON_MODE2                 1650
#define LC2INTN                       1651
#define CLC2CON_INTN                  1652
#define LC2INTP                       1653
#define CLC2CON_INTP                  1654
#define CLC2CON_OUT                   1655
#define LC2OUT                        1656
#define CLC2CON_EN                    1657
#define LC2EN                         1658
#define CLC2POL                       1659
#define LC2G1POL                      1660
#define CLC2POL_G1POL                 1661
#define LC2G2POL                      1662
#define CLC2POL_G2POL                 1663
#define LC2G3POL                      1664
#define CLC2POL_G3POL                 1665
#define LC2G4POL                      1666
#define CLC2POL_G4POL                 1667
#define CLC2POL_POL                   1668
#define LC2POL                        1669
#define CLC2SEL0                      1670
#define CLC2SEL0_D1S                  1671
#define LC2D1S0                       1672
#define CLC2SEL0_D1S0                 1673
#define LC2D1S                        1674
#define LC2D1S1                       1675
#define CLC2SEL0_D1S1                 1676
#define LC2D1S2                       1677
#define CLC2SEL0_D1S2                 1678
#define CLC2SEL0_D1S3                 1679
#define LC2D1S3                       1680
#define LC2D1S4                       1681
#define CLC2SEL0_D1S4                 1682
#define LC2D1S5                       1683
#define CLC2SEL0_D1S5                 1684
#define CLC2SEL1                      1685
#define LC2D2S0                       1686
#define CLC2SEL1_D2S0                 1687
#define LC2D2S                        1688
#define CLC2SEL1_D2S                  1689
#define LC2D2S1                       1690
#define CLC2SEL1_D2S1                 1691
#define LC2D2S2                       1692
#define CLC2SEL1_D2S2                 1693
#define LC2D2S3                       1694
#define CLC2SEL1_D2S3                 1695
#define LC2D2S4                       1696
#define CLC2SEL1_D2S4                 1697
#define LC2D2S5                       1698
#define CLC2SEL1_D2S5                 1699
#define CLC2SEL2                      1700
#define CLC2SEL2_D3S                  1701
#define LC2D3S0                       1702
#define CLC2SEL2_D3S0                 1703
#define LC2D3S                        1704
#define CLC2SEL2_D3S1                 1705
#define LC2D3S1                       1706
#define LC2D3S2                       1707
#define CLC2SEL2_D3S2                 1708
#define LC2D3S3                       1709
#define CLC2SEL2_D3S3                 1710
#define LC2D3S4                       1711
#define CLC2SEL2_D3S4                 1712
#define LC2D3S5                       1713
#define CLC2SEL2_D3S5                 1714
#define CLC2SEL3                      1715
#define LC2D4S0                       1716
#define CLC2SEL3_D4S                  1717
#define CLC2SEL3_D4S0                 1718
#define LC2D4S                        1719
#define LC2D4S1                       1720
#define CLC2SEL3_D4S1                 1721
#define LC2D4S2                       1722
#define CLC2SEL3_D4S2                 1723
#define CLC2SEL3_D4S3                 1724
#define LC2D4S3                       1725
#define LC2D4S4                       1726
#define CLC2SEL3_D4S4                 1727
#define LC2D4S5                       1728
#define CLC2SEL3_D4S5                 1729
#define CLC2GLS0                      1730
#define LC2G1D1N                      1731
#define CLC2GLS0_D1N                  1732
#define CLC2GLS0_D1T                  1733
#define LC2G1D1T                      1734
#define LC2G1D2N                      1735
#define CLC2GLS0_D2N                  1736
#define CLC2GLS0_D2T                  1737
#define LC2G1D2T                      1738
#define LC2G1D3N                      1739
#define CLC2GLS0_D3N                  1740
#define CLC2GLS0_D3T                  1741
#define LC2G1D3T                      1742
#define LC2G1D4N                      1743
#define CLC2GLS0_D4N                  1744
#define CLC2GLS0_D4T                  1745
#define LC2G1D4T                      1746
#define CLC2GLS1                      1747
#define CLC2GLS1_D1N                  1748
#define LC2G2D1N                      1749
#define CLC2GLS1_D1T                  1750
#define LC2G2D1T                      1751
#define CLC2GLS1_D2N                  1752
#define LC2G2D2N                      1753
#define CLC2GLS1_D2T                  1754
#define LC2G2D2T                      1755
#define LC2G2D3N                      1756
#define CLC2GLS1_D3N                  1757
#define LC2G2D3T                      1758
#define CLC2GLS1_D3T                  1759
#define LC2G2D4N                      1760
#define CLC2GLS1_D4N                  1761
#define LC2G2D4T                      1762
#define CLC2GLS1_D4T                  1763
#define CLC2GLS2                      1764
#define LC2G3D1N                      1765
#define CLC2GLS2_D1N                  1766
#define CLC2GLS2_D1T                  1767
#define LC2G3D1T                      1768
#define CLC2GLS2_D2N                  1769
#define LC2G3D2N                      1770
#define LC2G3D2T                      1771
#define CLC2GLS2_D2T                  1772
#define CLC2GLS2_D3N                  1773
#define LC2G3D3N                      1774
#define CLC2GLS2_D3T                  1775
#define LC2G3D3T                      1776
#define CLC2GLS2_D4N                  1777
#define LC2G3D4N                      1778
#define LC2G3D4T                      1779
#define CLC2GLS2_D4T                  1780
#define CLC2GLS3                      1781
#define LC2G4D1N                      1782
#define CLC2GLS3_G4D1N                1783
#define CLC2GLS3_G4D1T                1784
#define LC2G4D1T                      1785
#define CLC2GLS3_G4D2N                1786
#define LC2G4D2N                      1787
#define LC2G4D2T                      1788
#define CLC2GLS3_G4D2T                1789
#define CLC2GLS3_G4D3N                1790
#define LC2G4D3N                      1791
#define CLC2GLS3_G4D3T                1792
#define LC2G4D3T                      1793
#define LC2G4D4N                      1794
#define CLC2GLS3_G4D4N                1795
#define CLC2GLS3_G4D4T                1796
#define LC2G4D4T                      1797
#define CLC3CON                       1798
#define LC3MODE                       1799
#define CLC3CON_MODE0                 1800
#define LC3MODE0                      1801
#define CLC3CON_MODE                  1802
#define CLC3CON_MODE1                 1803
#define LC3MODE1                      1804
#define CLC3CON_MODE2                 1805
#define LC3MODE2                      1806
#define LC3INTN                       1807
#define CLC3CON_INTN                  1808
#define LC3INTP                       1809
#define CLC3CON_INTP                  1810
#define LC3OUT                        1811
#define CLC3CON_OUT                   1812
#define LC3EN                         1813
#define CLC3CON_EN                    1814
#define CLC3POL                       1815
#define LC3G1POL                      1816
#define CLC3POL_G1POL                 1817
#define LC3G2POL                      1818
#define CLC3POL_G2POL                 1819
#define CLC3POL_G3POL                 1820
#define LC3G3POL                      1821
#define LC3G4POL                      1822
#define CLC3POL_G4POL                 1823
#define LC3POL                        1824
#define CLC3POL_POL                   1825
#define CLC3SEL0                      1826
#define CLC3SEL0_D1S0                 1827
#define LC3D1S0                       1828
#define CLC3SEL0_D1S                  1829
#define LC3D1S                        1830
#define LC3D1S1                       1831
#define CLC3SEL0_D1S1                 1832
#define LC3D1S2                       1833
#define CLC3SEL0_D1S2                 1834
#define LC3D1S3                       1835
#define CLC3SEL0_D1S3                 1836
#define LC3D1S4                       1837
#define CLC3SEL0_D1S4                 1838
#define LC3D1S5                       1839
#define CLC3SEL0_D1S5                 1840
#define CLC3SEL1                      1841
#define CLC3SEL1_D2S                  1842
#define CLC3SEL1_D2S0                 1843
#define LC3D2S                        1844
#define LC3D2S0                       1845
#define CLC3SEL1_D2S1                 1846
#define LC3D2S1                       1847
#define CLC3SEL1_D2S2                 1848
#define LC3D2S2                       1849
#define CLC3SEL1_D2S3                 1850
#define LC3D2S3                       1851
#define CLC3SEL1_D2S4                 1852
#define LC3D2S4                       1853
#define CLC3SEL1_D2S5                 1854
#define LC3D2S5                       1855
#define CLC3SEL2                      1856
#define LC3D3S                        1857
#define CLC3SEL2_D3S                  1858
#define LC3D3S0                       1859
#define CLC3SEL2_D3S0                 1860
#define LC3D3S1                       1861
#define CLC3SEL2_D3S1                 1862
#define LC3D3S2                       1863
#define CLC3SEL2_D3S2                 1864
#define LC3D3S3                       1865
#define CLC3SEL2_D3S3                 1866
#define CLC3SEL2_D3S4                 1867
#define LC3D3S4                       1868
#define CLC3SEL2_D3S5                 1869
#define LC3D3S5                       1870
#define CLC3SEL3                      1871
#define CLC3SEL3_D4S0                 1872
#define LC3D4S0                       1873
#define CLC3SEL3_D4S                  1874
#define LC3D4S                        1875
#define LC3D4S1                       1876
#define CLC3SEL3_D4S1                 1877
#define LC3D4S2                       1878
#define CLC3SEL3_D4S2                 1879
#define LC3D4S3                       1880
#define CLC3SEL3_D4S3                 1881
#define LC3D4S4                       1882
#define CLC3SEL3_D4S4                 1883
#define LC3D4S5                       1884
#define CLC3SEL3_D4S5                 1885
#define CLC3GLS0                      1886
#define CLC3GLS0_D1N                  1887
#define LC3G1D1N                      1888
#define LC3G1D1T                      1889
#define CLC3GLS0_D1T                  1890
#define LC3G1D2N                      1891
#define CLC3GLS0_D2N                  1892
#define CLC3GLS0_D2T                  1893
#define LC3G1D2T                      1894
#define CLC3GLS0_D3N                  1895
#define LC3G1D3N                      1896
#define LC3G1D3T                      1897
#define CLC3GLS0_D3T                  1898
#define CLC3GLS0_D4N                  1899
#define LC3G1D4N                      1900
#define CLC3GLS0_D4T                  1901
#define LC3G1D4T                      1902
#define CLC3GLS1                      1903
#define LC3G2D1N                      1904
#define CLC3GLS1_D1N                  1905
#define CLC3GLS1_D1T                  1906
#define LC3G2D1T                      1907
#define LC3G2D2N                      1908
#define CLC3GLS1_D2N                  1909
#define LC3G2D2T                      1910
#define CLC3GLS1_D2T                  1911
#define LC3G2D3N                      1912
#define CLC3GLS1_D3N                  1913
#define CLC3GLS1_D3T                  1914
#define LC3G2D3T                      1915
#define LC3G2D4N                      1916
#define CLC3GLS1_D4N                  1917
#define LC3G2D4T                      1918
#define CLC3GLS1_D4T                  1919
#define CLC3GLS2                      1920
#define LC3G3D1N                      1921
#define CLC3GLS2_D1N                  1922
#define LC3G3D1T                      1923
#define CLC3GLS2_D1T                  1924
#define CLC3GLS2_D2N                  1925
#define LC3G3D2N                      1926
#define CLC3GLS2_D2T                  1927
#define LC3G3D2T                      1928
#define CLC3GLS2_D3N                  1929
#define LC3G3D3N                      1930
#define LC3G3D3T                      1931
#define CLC3GLS2_D3T                  1932
#define CLC3GLS2_D4N                  1933
#define LC3G3D4N                      1934
#define CLC3GLS2_D4T                  1935
#define LC3G3D4T                      1936
#define CLC3GLS3                      1937
#define LC3G4D1N                      1938
#define CLC3GLS3_G4D1N                1939
#define LC3G4D1T                      1940
#define CLC3GLS3_G4D1T                1941
#define LC3G4D2N                      1942
#define CLC3GLS3_G4D2N                1943
#define CLC3GLS3_G4D2T                1944
#define LC3G4D2T                      1945
#define LC3G4D3N                      1946
#define CLC3GLS3_G4D3N                1947
#define CLC3GLS3_G4D3T                1948
#define LC3G4D3T                      1949
#define LC3G4D4N                      1950
#define CLC3GLS3_G4D4N                1951
#define LC3G4D4T                      1952
#define CLC3GLS3_G4D4T                1953
#define CLC4CON                       1954
#define LC4MODE                       1955
#define CLC4CON_MODE                  1956
#define LC4MODE0                      1957
#define CLC4CON_MODE0                 1958
#define LC4MODE1                      1959
#define CLC4CON_MODE1                 1960
#define LC4MODE2                      1961
#define CLC4CON_MODE2                 1962
#define LC4INTN                       1963
#define CLC4CON_INTN                  1964
#define CLC4CON_INTP                  1965
#define LC4INTP                       1966
#define CLC4CON_OUT                   1967
#define LC4OUT                        1968
#define CLC4CON_EN                    1969
#define LC4EN                         1970
#define CLC4POL                       1971
#define CLC4POL_G1POL                 1972
#define LC4G1POL                      1973
#define CLC4POL_G2POL                 1974
#define LC4G2POL                      1975
#define CLC4POL_G3POL                 1976
#define LC4G3POL                      1977
#define LC4G4POL                      1978
#define CLC4POL_G4POL                 1979
#define LC4POL                        1980
#define CLC4POL_POL                   1981
#define CLC4SEL0                      1982
#define CLC4SEL0_D1S0                 1983
#define LC4D1S0                       1984
#define CLC4SEL0_D1S                  1985
#define LC4D1S                        1986
#define CLC4SEL0_D1S1                 1987
#define LC4D1S1                       1988
#define CLC4SEL0_D1S2                 1989
#define LC4D1S2                       1990
#define CLC4SEL0_D1S3                 1991
#define LC4D1S3                       1992
#define CLC4SEL0_D1S4                 1993
#define LC4D1S4                       1994
#define CLC4SEL0_D1S5                 1995
#define LC4D1S5                       1996
#define CLC4SEL1                      1997
#define LC4D2S0                       1998
#define CLC4SEL1_D2S                  1999
#define CLC4SEL1_D2S0                 2000
#define LC4D2S                        2001
#define CLC4SEL1_D2S1                 2002
#define LC4D2S1                       2003
#define LC4D2S2                       2004
#define CLC4SEL1_D2S2                 2005
#define LC4D2S3                       2006
#define CLC4SEL1_D2S3                 2007
#define LC4D2S4                       2008
#define CLC4SEL1_D2S4                 2009
#define LC4D2S5                       2010
#define CLC4SEL1_D2S5                 2011
#define CLC4SEL2                      2012
#define LC4D3S                        2013
#define CLC4SEL2_D3S                  2014
#define CLC4SEL2_D3S0                 2015
#define LC4D3S0                       2016
#define LC4D3S1                       2017
#define CLC4SEL2_D3S1                 2018
#define CLC4SEL2_D3S2                 2019
#define LC4D3S2                       2020
#define CLC4SEL2_D3S3                 2021
#define LC4D3S3                       2022
#define CLC4SEL2_D3S4                 2023
#define LC4D3S4                       2024
#define CLC4SEL2_D3S5                 2025
#define LC4D3S5                       2026
#define CLC4SEL3                      2027
#define LC4D4S0                       2028
#define LC4D4S                        2029
#define CLC4SEL3_D4S0                 2030
#define CLC4SEL3_D4S                  2031
#define LC4D4S1                       2032
#define CLC4SEL3_D4S1                 2033
#define LC4D4S2                       2034
#define CLC4SEL3_D4S2                 2035
#define LC4D4S3                       2036
#define CLC4SEL3_D4S3                 2037
#define LC4D4S4                       2038
#define CLC4SEL3_D4S4                 2039
#define LC4D4S5                       2040
#define CLC4SEL3_D4S5                 2041
#define CLC4GLS0                      2042
#define CLC4GLS0_D1N                  2043
#define LC4G1D1N                      2044
#define CLC4GLS0_D1T                  2045
#define LC4G1D1T                      2046
#define CLC4GLS0_D2N                  2047
#define LC4G1D2N                      2048
#define CLC4GLS0_D2T                  2049
#define LC4G1D2T                      2050
#define CLC4GLS0_D3N                  2051
#define LC4G1D3N                      2052
#define CLC4GLS0_D3T                  2053
#define LC4G1D3T                      2054
#define CLC4GLS0_D4N                  2055
#define LC4G1D4N                      2056
#define CLC4GLS0_D4T                  2057
#define LC4G1D4T                      2058
#define CLC4GLS1                      2059
#define CLC4GLS1_D1N                  2060
#define LC4G2D1N                      2061
#define CLC4GLS1_D1T                  2062
#define LC4G2D1T                      2063
#define LC4G2D2N                      2064
#define CLC4GLS1_D2N                  2065
#define LC4G2D2T                      2066
#define CLC4GLS1_D2T                  2067
#define CLC4GLS1_D3N                  2068
#define LC4G2D3N                      2069
#define LC4G2D3T                      2070
#define CLC4GLS1_D3T                  2071
#define CLC4GLS1_D4N                  2072
#define LC4G2D4N                      2073
#define CLC4GLS1_D4T                  2074
#define LC4G2D4T                      2075
#define CLC4GLS2                      2076
#define CLC4GLS2_D1N                  2077
#define LC4G3D1N                      2078
#define CLC4GLS2_D1T                  2079
#define LC4G3D1T                      2080
#define LC4G3D2N                      2081
#define CLC4GLS2_D2N                  2082
#define LC4G3D2T                      2083
#define CLC4GLS2_D2T                  2084
#define CLC4GLS2_D3N                  2085
#define LC4G3D3N                      2086
#define CLC4GLS2_D3T                  2087
#define LC4G3D3T                      2088
#define LC4G3D4N                      2089
#define CLC4GLS2_D4N                  2090
#define LC4G3D4T                      2091
#define CLC4GLS2_D4T                  2092
#define CLC4GLS3                      2093
#define CLC4GLS3_G4D1N                2094
#define LC4G4D1N                      2095
#define LC4G4D1T                      2096
#define CLC4GLS3_G4D1T                2097
#define LC4G4D2N                      2098
#define CLC4GLS3_G4D2N                2099
#define LC4G4D2T                      2100
#define CLC4GLS3_G4D2T                2101
#define CLC4GLS3_G4D3N                2102
#define LC4G4D3N                      2103
#define CLC4GLS3_G4D3T                2104
#define LC4G4D3T                      2105
#define LC4G4D4N                      2106
#define CLC4GLS3_G4D4N                2107
#define LC4G4D4T                      2108
#define CLC4GLS3_G4D4T                2109
#define STATUS_SHAD                   2110
#define C_SHAD                        2111
#define DC_SHAD                       2112
#define Z_SHAD                        2113
#define WREG_SHAD                     2114
#define BSR_SHAD                      2115
#define PCLATH_SHAD                   2116
#define FSR0L_SHAD                    2117
#define FSR0H_SHAD                    2118
#define FSR1L_SHAD                    2119
#define FSR1H_SHAD                    2120
#define STKPTR                        2121
#define TOSL                          2122
#define TOSH                          2123

#endif // _PIC16LF18344_H_
